app/controllers/pages_controller.rb

INSERT INTO "pages" ("content", "created_at", "style", "title", "updated_at") VALUES (?, ?, ?, ?, ?)  [["content", ""], ["created_at", Tue, 30 Jul 2013 20:02:16 UTC +00:00], ["style", ""], ["title", ""], ["updated_at", Tue, 30 Jul 2013 20:02:16 UTC +00:00]]
---
    def create

      @page = Page.new(page_params)
      @page.save

SELECT "pages".* FROM "pages" WHERE "pages"."id" = ? LIMIT 1  [["id", "show"]]
---
    def show
      # create json for angular
      @page = Page.find(params[:id])