app/controllers/projects_controller.rb

  def index
    @project = Project.new
    @subcategories = Subcategory.all
---
SELECT "categories".* FROM "categories"